//
//  ViewController.swift
//  CountryPlayground
//
//  Created by Strogalev Ilia on 09/12/2020.
//

import UIKit

class ViewController: UIViewController, UITextFieldDelegate /*, UITableViewDelegate, UITableViewDataSource*/ {
    

    @IBOutlet weak var textField: UITextField!
    @IBOutlet weak var countryCode: UILabel!
    @IBOutlet weak var countryFlag: UILabel!
    @IBOutlet weak var resultButton: UIButton!
    
    @IBOutlet weak var errorMessage: UILabel!
    
    
 //   @IBOutlet weak var tableView: UITableView!
    
    
    //Как же муторно было это все вбивать в словарь...кто бы знал...
    var code = [
        
/*A*/   "Австралия": "AU", "Австрия": "AT", "Азербайджан": "AZ", "Албания": "AL", "Алжир": "DZ", "Ангилья": "AI",  "Ангола": "AO", "Андорра": "AD", "Антарктика": "AQ", "Антигуа": "AG", "Антильские острова": "AN", "Аргентина": "AR", "Армения": "AM", "Аруба": "AW", "Афганистан": "AF",
/*Б*/   "Багамские острова": "BS", "Бангладеш": "BD", "Барбадос": "BB", "Бахрейн": "BH", "Белиз": "BZ", "Беларусь": "BY", "Бельгия": "BE", "Бенин": "BJ", "Бермудские острова": "BM", "Болгария": "BG", "Боливия": "BO", "Ботсвана": "BW", "Бразилия": "BR", "Бруней": "BN", "Буве": "BV", "Буркина-Фасо": "BF", "Бурунди": "BI", "Бутан": "BT",
/*В*/   "Вануату": "VU", "Ватикан": "VA", "Великобритания": "GB", "Венгрия": "HU", "Венесуэла": "VE", "Виргинские острова": "VI", "Восточное Самоа": "AS", "Восточный Тимор": "TP", "Вьетнам": "VN",
/*Г*/ "Габон": "GA", "Гаити": "HT", "Гайана": "GY", "Гамбия": "GM", "Гана": "GH", "Гваделупа": "GP", "Гватемала": "GT", "Гвиана": "GF", "Гвинея": "GN", "Гвинея-Бисау": "GW", "Германия": "DE", "Гибралтар": "GI", "Гондурас": "HN", "Гренада": "GD", "Гренландия": "GL", "Греция": "GR", "Грузия": "GE", "Гуам": "GU", "Гонконг": "HK",
/*Д*/   "Дания": "DK", "Джибути": "DJ", "Джостон Атолл": "JT", "Доминика": "DM", "Доминиканская Респубрика": "DO",
/*Е*/   "Египет": "EG",
/*З*/   "Заир": "ZR", "Замбия": "ZM", "Западная Сахара": "EH", "Западное Самоа": "WS", "Зимбабве": "ZW",
/*И*/   "Израиль": "IL", "Индия": "IN", "Индонезия": "ID", "Иордан": "JO", "Ирак": "IQ", "Иран": "IR", "Ирландия": "IE", "Исландия": "IS", "Испания": "ES", "Италия": "IT",
/*Й*/   "Йемен": "YE",
/*К*/   "Кабо-Верде": "CV", "Казахстан": "KZ", "Кайман": "KY", "Камбоджа": "KH", "Камерун": "CM", "Канада": "CA", "Катар": "QA", "Кения": "KE", "Кипр": "CY", "Кирибати": "KI", "Китай": "CN", "Кокосовые острова": "CC", "Колумбия": "CO", "Коморские острова": "KM", "Конго": "CG", "Северная Корея": "KP", "Южная Корея": "KR", "Коста-Рика": "CR", "Кот-Дивуар": "CI", "Куба": "CU", "Кувейт": "KW", "Кыргызстан": "KG",
/*Л*/   "Лаос": "LA", "Латвия": "LV", "Литва": "LT", "Лесото": "LS", "Либерия": "LR", "Ливан": "LB", "Ливия": "LY", "Лихтенштейн": "LI", "Люксембург": "LU",
/*М*/   "Маврикий": "MU", "Мавритания": "MR", "Мадагаскар": "MG", "Малави": "MW", "Малайзия": "MY", "Мали": "ML", "Малые тихоокеанские острова": "UM", "Мальдивы": "MV", "Мальта": "MT", "Марианские острова": "MP", "Марокко": "MA", "Мартиника": "MQ", "Маршалловы острова": "MH", "Мексика": "MX", "Микронезия": "FM", "Мозамбик": "MZ", "Молдова": "MD", "Монако": "MC", "Монголия": "MN", "Монсеррат": "MS", "Мьянма": "MM",
/*Н*/   "Намибия": "NA", "Науру": "NR", "Непал": "NP", "Нигер": "NE", "Нигерия": "NG", "Нидерланды": "NL", "Никарагуа": "NI", "Ниуэ": "NU", "Новая Зеландия": "NZ", "Новая Каледония": "NC", "Норвегия": "NO", "Норфолк": "NF",
/*О*/   "ОАЭ": "AE", "Оман": "OM", "Острова Кука": "CK", "Острова Мидуэй": "MI", "Остров Мэн": "IM", "Остров Рождества": "CX", "Остров Святой Елены": "SH", "Остров Уэйк": "WK",
/*П*/   "Пакистан": "PK", "Палау": "PW", "Панама": "PA", "Папуа-Новая Гвинея": "PG", "Парагвай": "PY", "Перу": "PE", "Питкэрн": "PN", "Польша": "PL", "Португалия": "PT", "Пуэрто-Рико": "PR", "Полинезия": "PF",
/*Р*/   "Разделенная Зона": "NT", "Реюньон": "RE", "Россия": "RU", "Руанда": "RW", "Румыния": "RO",
/*С*/   "Сальвадор": "SV", "Сан-Марино": "SM", "Сан-Томе": "ST", "Саудовская Аравия": "SA", "Свазиленд": "SZ", "Сейшельские острова": "SC", "Святой-Пьер и Микелон": "PM", "Сенегал": "SN", "Святой Винсент": "VC", "Сент-Китс и Невис": "KN", "Сент-Люсия": "LC", "Сингапур": "SG", "Сирия": "SY", "Словакия": "SK", "Соломоновы острова": "SB", "Сомали": "SO", "Судан": "SD", "Суринам": "SR", "Сьерра-Леоне": "SL", "США": "US", "Сянган": "HK",
/*Т*/   "Таджикистан": "TJ", "Таиланд": "TH", "Тайвань": "TW", "Танзания": "TZ", "Теркс и Кайкос": "TC", "Того": "TG", "Токелау": "TK", "Тонга": "TO", "Тринидад и Тобаго": "TT", "Тувалу": "TV", "Тунис": "TN", "Туркменистан": "TM", "Турция": "TR",
/*У*/   "Уганда": "UG", "Узбекистан": "UZ", "Украина": "UA", "Уоллис и Футуна": "WF", "Уругвай": "UY",
/*Ф*/   "Фарерские острова": "FO", "Фиджи": "FJ", "Филиппины": "PH", "Финляндия": "FI", "Фолклендские острова": "FK", "Франция": "FR",
/*Х*/   "Херд и Макдональд": "HM",
/*Ц*/   "ЦАР": "CF",
/*Ч*/   "ЧАД": "TD", "Чехия": "CZ", "Чили": "CL",
/*Ш*/   "Швейцария": "CH", "Швеция": "SE", "Шпицберген": "SJ", "Шри-Ланка": "LK",
/*Э*/   "Эквадор": "EC", "Экватор": "GQ", "Эстония": "EE", "Эфиопия": "ET",
/*Ю*/   "Югославия": "YU", "ЮАР": "ZA", "Южные территории": "TF",
/*Я*/   "Ямайка": "JM", "Япония": "JP"
    ]
    
    var flag = [
        
/*A*/   "Австралия": "🇦🇺", "Австрия": "🇦🇹", "Азербайджан": "🇦🇿", "Албания": "🇦🇱", "Алжир": "🇩🇿", "Ангилья": "🇦🇮",  "Ангола": "🇦🇴", "Андорра": "🇦🇩", "Антарктика": "🇦🇶", "Антигуа": "🇦🇬", "Антильские острова": "🇦🇽", "Аргентина": "🇦🇷", "Армения": "🇦🇲", "Аруба": "🇦🇼", "Афганистан": "🇦🇫",
/*Б*/   "Багамские острова": "🇧🇸", "Бангладеш": "🇧🇩", "Барбадос": "🇧🇧", "Бахрейн": "🇧🇭", "Белиз": "", "Беларусь": "🇧🇾", "Бельгия": "🇧🇪", "Бенин": "🇧🇯", "Бермудские острова": "🇧🇲", "Болгария": "🇧🇬", "Боливия": "🇧🇴", "Ботсвана": "🇧🇼", "Бразилия": "🇧🇷", "Бруней": "🇧🇳", "Буве": "🇧🇻", "Буркина-Фасо": "🇧🇫", "Бурунди": "🇧🇮", "Бутан": "🇧🇹",
/*В*/   "Вануату": "🇻🇺", "Ватикан": "🇻🇦", "Великобритания": "🇬🇧", "Венгрия": "🇭🇺", "Венесуэла": "🇻🇪", "Виргинские острова": "🇻🇬", "Восточное Самоа": "", "Восточный Тимор": "", "Вьетнам": "🇻🇳",
/*Г*/ "Габон": "🇬🇦", "Гаити": "🇭🇹", "Гайана": "🇬🇫", "Гамбия": "🇬🇲", "Гана": "🇬🇭", "Гваделупа": "🇬🇵", "Гватемала": "🇬🇹", "Гвиана": "🇬🇾", "Гвинея": "🇬🇳", "Гвинея-Бисау": "", "Германия": "🇩🇪", "Гибралтар": "🇬🇮", "Гондурас": "🇭🇳", "Гренада": "🇬🇩", "Гренландия": "🇬🇱", "Греция": "🇬🇷", "Грузия": "🇬🇪", "Гуам": "🇬🇺", "Гонконг": "🇭🇰",
/*Д*/   "Дания": "🇩🇰", "Джибути": "🇩🇯", "Джостон Атолл": "", "Доминика": "🇩🇲", "Доминиканская Респубрика": "🇩🇴",
/*Е*/   "Египет": "🇪🇬",
/*З*/   "Заир": "", "Замбия": "🇿🇲", "Западная Сахара": "🇪🇭", "Западное Самоа": "🇼🇸", "Зимбабве": "🇿🇼",
/*И*/   "Израиль": "🇮🇱", "Индия": "🇮🇳", "Индонезия": "🇮🇩", "Иордан": "🇯🇴", "Ирак": "🇮🇶", "Иран": "🇮🇷", "Ирландия": "🇮🇪", "Исландия": "🇮🇸", "Испания": "🇪🇸", "Италия": "🇮🇹",
/*Й*/   "Йемен": "🇾🇪",
/*К*/   "Кабо-Верде": "🇨🇻", "Казахстан": "🇰🇿", "Кайман": "", "Камбоджа": "🇰🇭", "Камерун": "🇨🇲", "Канада": "🇨🇦", "Катар": "🇶🇦", "Кения": "🇰🇪", "Кипр": "🇨🇾", "Кирибати": "🇰🇮", "Китай": "🇨🇳", "Кокосовые острова": "🇨🇨", "Колумбия": "🇨🇴", "Коморские острова": "🇮🇨", "Конго": "🇨🇩", "Северная Корея": "🇰🇵", "Южная Корея": "", "Коста-Рика": "🇨🇷", "Кот-Дивуар": "🇨🇮", "Куба": "🇨🇺", "Кувейт": "🇰🇼", "Кыргызстан": "🇰🇬",
/*Л*/   "Лаос": "🇱🇦", "Латвия": "🇱🇻", "Литва": "🇱🇹", "Лесото": "🇱🇸", "Либерия": "🇱🇷", "Ливан": "🇱🇧", "Ливия": "🇱🇾", "Лихтенштейн": "🇱🇮", "Люксембург": "🇱🇺",
/*М*/   "Маврикий": "🇲🇺", "Мавритания": "🇲🇷", "Мадагаскар": "🇲🇬", "Малави": "🇲🇼", "Малайзия": "🇲🇾", "Мали": "🇲🇱", "Малые тихоокеанские острова": "", "Мальдивы": "🇲🇻", "Мальта": "🇲🇹", "Марианские острова": "🇲🇵", "Марокко": "🇲🇦", "Мартиника": "🇲🇶", "Маршалловы острова": "🇲🇭", "Мексика": "🇲🇽", "Микронезия": "🇫🇲", "Мозамбик": "🇲🇿", "Молдова": "🇲🇩", "Монако": "🇲🇨", "Монголия": "🇲🇳", "Монсеррат": "🇲🇸", "Мьянма": "🇲🇲",
/*Н*/   "Намибия": "🇳🇦", "Науру": "🇳🇷", "Непал": "🇳🇵", "Нигер": "🇳🇪", "Нигерия": "🇳🇬", "Нидерланды": "🇳🇱", "Никарагуа": "🇳🇮", "Ниуэ": "🇳🇺", "Новая Зеландия": "🇳🇿", "Новая Каледония": "🇳🇨", "Норвегия": "🇳🇴", "Норфолк": "🇳🇫",
/*О*/   "ОАЭ": "🇦🇪", "Оман": "🇴🇲", "Острова Кука": "🇨🇰", "Острова Мидуэй": "", "Остров Мэн": "🇮🇲", "Остров Рождества": "🇨🇽", "Остров Святой Елены": "🇸🇭", "Остров Уэйк": "",
/*П*/   "Пакистан": "🇵🇰", "Палау": "🇵🇼", "Панама": "🇵🇦", "Папуа-Новая Гвинея": "🇵🇬", "Парагвай": "🇵🇾", "Перу": "🇵🇪", "Питкэрн": "🇵🇳", "Польша": "🇵🇱", "Португалия": "🇵🇹", "Пуэрто-Рико": "🇵🇷", "Полинезия": "🇵🇫",
/*Р*/   "Разделенная Зона": "", "Реюньон": "🇷🇪", "Россия": "🇷🇺", "Руанда": "🇷🇼", "Румыния": "🇷🇴",
/*С*/   "Сальвадор": "🇸🇻", "Сан-Марино": "🇸🇲", "Сан-Томе": "🇸🇹", "Саудовская Аравия": "🇸🇦", "Свазиленд": "", "Сейшельские острова": "🇸🇨", "Святой-Пьер и Микелон": "🇵🇲", "Сенегал": "🇸🇳", "Святой Винсент": "🇻🇨", "Сент-Китс и Невис": "🇰🇳", "Сент-Люсия": "🇱🇨", "Сингапур": "🇸🇬", "Сирия": "🇸🇾", "Словакия": "🇸🇰", "Соломоновы острова": "🇸🇧", "Сомали": "🇸🇴", "Судан": "🇸🇩", "Суринам": "🇸🇷", "Сьерра-Леоне": "🇸🇱", "США": "🇺🇸", "Сянган": "🇭🇰",
/*Т*/   "Таджикистан": "🇹🇯", "Таиланд": "🇹🇭", "Тайвань": "🇹🇼", "Танзания": "🇹🇿", "Теркс и Кайкос": "🇹🇨", "Того": "🇹🇬", "Токелау": "🇹🇰", "Тонга": "🇹🇴", "Тринидад и Тобаго": "🇹🇹", "Тувалу": "🇹🇻", "Тунис": "🇹🇳", "Туркменистан": "🇹🇲", "Турция": "🇹🇷",
/*У*/   "Уганда": "🇺🇬", "Узбекистан": "🇺🇿", "Украина": "🇺🇦", "Уоллис и Футуна": "", "Уругвай": "🇺🇾",
/*Ф*/   "Фарерские острова": "🇫🇴", "Фиджи": "🇫🇯", "Филиппины": "🇵🇭", "Финляндия": "🇫🇮", "Фолклендские острова": "🇫🇰", "Франция": "🇫🇷",
/*Х*/   "Херд и Макдональд": "🇭🇲",
/*Ц*/   "ЦАР": "🇨🇫",
/*Ч*/   "ЧАД": "🇹🇩", "Чехия": "🇨🇿", "Чили": "🇨🇱",
/*Ш*/   "Швейцария": "🇨🇭", "Швеция": "🇸🇪", "Шпицберген": "", "Шри-Ланка": "🇱🇰",
/*Э*/   "Эквадор": "🇪🇨", "Экватор": "", "Эстония": "🇪🇪", "Эфиопия": "🇪🇹",
/*Ю*/   "Югославия": "", "ЮАР": "🇿🇦", "Южные территории": "🇬🇸",
/*Я*/   "Ямайка": "🇯🇲", "Япония": "🇯🇵"
        
    ]
/*
    func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return code.count
    }
    
    func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
        let cell = tableView.dequeueReusableCell(withIdentifier: "cell") as! TableViewCell
        cell.countryLabel.text = code[indexPath.row].stringValue
    }
*/
    override func viewWillAppear(_ animated: Bool) {
        errorMessage.isHidden = true
    }
    
    override func viewDidLoad() {
        super.viewDidLoad()
 //       tableView.delegate = self
 //       tableView.dataSource = self
        textField.delegate = self
    }
    
    func textFieldShouldReturn(_ textField: UITextField) -> Bool {
        resultButtonAction(self)
        return true
        
    }
    
    func getCountryCode(name: String) {
        countryCode.text = code["\(textField.text!)"]
       
    }
    
    func getCountryFlag(name: String) {
        countryFlag.text = flag["\(textField.text!)"]
    }

    @IBAction func resultButtonAction(_ sender: Any) {
        if textField.text == "" {
            return
        }
        self.getCountryCode(name: textField.text!)
        self.getCountryFlag(name: textField.text!)
        if countryCode.text == "" {
            errorMessage.isHidden = false
        } else if countryFlag.text == "" {
            errorMessage.isHidden = false
        }
        errorMessage.isHidden = true
        textField.resignFirstResponder()
    }
    
}

